Repository: nawtyfellaz/shooze
Catalog: locale/LC_MESSAGES/django.po
Languages: ar, nb, zh_cn

source: Fake call to %(number)s: "Your token is: %(token)s"
ar: مكالمة وهمية للرقم %(number)s: "رمز التفويض الخاص بك: %(token)s"
nb: Liksom oppringing til %(number)s: "Din kode er: %(token)s"
zh_cn: 呼叫 %(number)s: "Your token is: %(token)s"

source: Fake SMS to %(number)s: "Your token is: %(token)s"
ar: رسالة نصية قصيرة وهمية للرقم %(number)s: "رمز التفويض الخاص بك: %(token)s"
nb: Liksom SMS til %(number)s: "Din kode er: %(token)s"
zh_cn: 给 %(number)s 发短信: "Your token is: %(token)s"

source: Toggle navigation
ar: تفعيل التصفّح
nb: Veksle navigasjon
zh_cn: 切换导航栏

source: Demo
ar: عرض تجريبي
zh_cn: 示例

source: Home
ar: الرئيسية
nb: Hjem
zh_cn: 首页

source: Secret Page
ar: صفحة سرية
nb: Hemmelig side
zh_cn: 私密页面

source: Account Security
ar: أمان الحساب
nb: Kontosikkerhet
zh_cn: 账户安全

source: Sessions
ar: الجلسات
nb: Økter
zh_cn: 会话

source: Logout
ar: تسجيل الخروج
nb: Logg ut
zh_cn: 退出

source: Not logged in
ar: غير مسجّل الدخول
nb: Ikke innlogget
zh_cn: 未登录

source: Login
ar: تسجيل الدخول
nb: Innlogging
zh_cn: 登录

source: django-two-factor-auth – Demo Application
ar: django-two-factor-auth – عرض تجريبي
nb: django-two-factor-auth – Demo-applikasjon
zh_cn: django-two-factor-auth – 示例应用

source: Improve Your Security <small>your users will thank you</small>
ar: ترقية الأمان <small>مستخدمي الخدمة سوف يشكرونك </small>
nb: Forbedre sikkerheten <small>brukerene vil være takknemlige</small>
zh_cn: 提高您的安全性 <small>您的用户会感谢您的</small>

source: Welcome to the example app of <code>django-two-factor-auth</code>. Use this example to get an understanding of what the app can do for you.
ar: مرحبا بك في هذا المثال للتطبيق <code>django-two-factor-auth</code>. استخدم هذا المثال لتفهم ماذا يمكن ان يعمل هذا التطبيق لك.
nb: Velkommen til eksempel-appen for <code>django-two-factor-auth</code>. Bruk dette eksemplet for å få en forståelse av hva denne appen kan gjøre for deg.
zh_cn: 欢迎来到 <code>django-two-factor-auth</code> 示例应用。通过使用这个示例站点您可以更好的理解我们的应用能为你实现哪些功能。

source: Please verify your settings
ar: الرجاء التحقق من الإعدادات
nb: Verifiser innstillingene dine
zh_cn: 请验证您的设置

source: Have you provided your Twilio settings in the <code>settings_private.py</code> file? By doing so, the example app will be able to call and text you to verify your authentication tokens. Otherwise, the tokens will be shown on the screen.
ar: هل تم وضع إعدادات Twilio في الملف <code>settings_private.py</code> ؟ عند وضعها التطبيق التجريبي سيتمكن من الإتصال بك و إرسال الرسائل النصية بمفاتيح التفويض. إن لم يتم ذلك سوف تظهر مفاتيح التفويض على الشاشة.
nb: Har du oppgitt Twilio-innstillinger i <code>settings_private.py</code> filen? Ved å gjøre dette, kan eksempel-appen ringe og sende SMS for å verifisere autentiserings kodene dine. Ellers vil kodene bli vist på skjermen.
zh_cn: 您有在 <code>settings_private.py</code> 文件中配好 Twilio 相关的配置项吗？配好后，示例应用就可以通过呼叫您或给您发短信的方式来验证您的授权验证码了。否则，验证码将被直接显示在屏幕上。

source: Next steps:
ar: الخطوات التالية:
nb: Neste trinn:
zh_cn: 下一步：

source: Start by <a href="%(reg_url)s">registering</a> an account.
ar: البدأ من خلال <a href="%(reg_url)s">تسجيل</a> an حساب.
nb: Begynn med <a href="%(reg_url)s">å registrere</a> en konto.
zh_cn: 从 <a href="%(reg_url)s">注册</a> 账户开始。

source: <a href="%(login_url)s">Login</a> to your account.
ar: <a href="%(login_url)s">الدخول</a> لحسابك.
nb: <a href="%(login_url)s">Logg inn</a> på kontoen din.
zh_cn: <a href="%(login_url)s">登录</a> 账户。

source: <a href="%(setup_url)s">Enable</a> two-factor authentication.
ar: <a href="%(setup_url)s">تفعيل</a> خاصية التحقق من خلال خطوتين.
nb: <a href="%(setup_url)s">Aktiver</a> to-faktor-autentisering.
zh_cn: <a href="%(setup_url)s">启动</a> 两步验证。

source: Then, <a href="%(logout_url)s">logout</a> and <a href="%(login_url)s">login</a> once more to your account to see two-factor authentication at work.
ar: إذن, <a href="%(logout_url)s">سجّل الخروج</a> و أعد <a href="%(login_url)s">تسجيل الدخول</a> لحسابك مرة اخرى لكي ترى خاصية التحقق من خطوتين تعمل.
nb: Deretter, <a href="%(logout_url)s">logg ut</a> og <a href="%(login_url)s">logg inn</a> igjen på kontoen din for å se hvordan to-faktor-autentisering virker.
zh_cn: 然后，<a href="%(logout_url)s">退出</a> 再 <a href="%(login_url)s">登录</a> 多试几次以便确认两步验证功能是否生效。

source: At last, you've gained access to the <a href="%(secret_url)s">secret page</a>! :-)
ar: و أخيرا, تم الولوج <a href="%(secret_url)s">للصفحة السرية</a>! :-)
nb: Endelig har du fått tilgang til <a href="%(secret_url)s">den hemmelige siden</a>! :-)
zh_cn: 最后，您获得了访问 <a href="%(secret_url)s">私密页面</a> 的权限！<(=⌒_⌒=)>

source: Registration
ar: التسجيل
nb: Registrering
zh_cn: 注册

source: Register
ar: تسجيل
nb: Registrer
zh_cn: 注册

source: Registration Complete
ar: تم التسجيل
nb: Registrering fullført
zh_cn: 注册完成

source: Congratulations, you've successfully registered an account.
ar: تهانينا, تم تسجيل عملية التسجيل بنجاح.
nb: Gratulerer, du har nå registrert en konto.
zh_cn: 恭喜，您成功注册了一个账户。

source: Congratulations, you've made it. You have successfully enabled two-factor authentication and logged in with your token.
ar: تهانينا, تم تفعيل خاصية التحقق من خطوتين بنجاح و تسجيل الدخول من خلال رمز التفويض الخاص بك.
nb: Gratulerer, du klarte det. Du har nå lykkes med å aktivere to-faktor-autentisering.
zh_cn: 恭喜，您做到了。您成功启用了两步验证并成功使用验证码进行登录。

source: Logged Out
ar: تم تسجيل الخروج
nb: Utlogget
zh_cn: 已退出

source: See you around!
ar: نراك لاحقا!
nb: Vi sees!
zh_cn: 拜拜！ 〽(ㄒ〰ㄒ=)>
